In [2]:
import numpy as np
import pandas as pd

In [3]:
dict = {
        "name":['harry',"rohan","anuj"],
        "marks":[92,34,24],
        "city" : ["rampur","kolkata", "mhow"]
        }

In [4]:
df = pd.DataFrame(dict)

In [5]:
df

    name  marks     city
0  harry     92   rampur
1  rohan     34  kolkata
2   anuj     24     mhow

In [6]:
df.to_csv('friends.csv',index=False)

In [7]:
df.head(2)

    name  marks     city
0  harry     92   rampur
1  rohan     34  kolkata

In [8]:
df.tail(2)

    name  marks     city
1  rohan     34  kolkata
2   anuj     24     mhow

In [9]:
df.describe()

          marks
count   3.00000
mean   50.00000
std    36.71512
min    24.00000
25%    29.00000
50%    34.00000
75%    63.00000
max    92.00000

In [10]:
df2 = pd.read_csv("friends.csv")

In [11]:
df2

    name  marks     city
0  harry     92   rampur
1  rohan     34  kolkata
2   anuj     24     mhow

In [12]:
df2

    name  marks     city
0  harry     92   rampur
1  rohan     34  kolkata
2   anuj     24     mhow

In [13]:
df2

    name  marks     city
0  harry     92   rampur
1  rohan     34  kolkata
2   anuj     24     mhow

In [14]:
df2

    name  marks     city
0  harry     92   rampur
1  rohan     34  kolkata
2   anuj     24     mhow

In [15]:
df2['marks']

0    92
1    34
2    24
Name: marks, dtype: int64

In [16]:
df2['marks'][0] = 90

C:\Users\yadav\AppData\Local\Temp\ipykernel_4352\1865368393.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df2['marks'][0] = 90

In [17]:
df2

    name  marks     city
0  harry     90   rampur
1  rohan     34  kolkata
2   anuj     24     mhow

In [18]:
df2.index=[1,2,3]

In [19]:
df2

    name  marks     city
1  harry     90   rampur
2  rohan     34  kolkata
3   anuj     24     mhow

In [20]:
ser = pd.Series(np.random.rand(20))

In [21]:
ser

0     0.117662
1     0.167244
2     0.480863
3     0.270825
4     0.987820
5     0.372854
6     0.165492
7     0.052615
8     0.016183
9     0.537709
10    0.999570
11    0.138278
12    0.600887
13    0.122013
14    0.270660
15    0.627779
16    0.022603
17    0.171937
18    0.197567
19    0.134696
dtype: float64

In [22]:
type(ser)

pandas.core.series.Series

In [23]:
df3 = pd.DataFrame(np.random.rand(334,5),index=np.arange(334))

In [24]:
df3.head(10)

          0         1         2         3         4
0  0.721386  0.407092  0.677209  0.788946  0.434118
1  0.138462  0.076653  0.711549  0.381831  0.486913
2  0.941958  0.566208  0.092995  0.778204  0.508077
3  0.333548  0.282038  0.043280  0.732699  0.298873
4  0.286634  0.729357  0.368197  0.162860  0.570876
5  0.306051  0.858420  0.008512  0.787170  0.002022
6  0.615842  0.518984  0.644410  0.164802  0.760038
7  0.832138  0.284155  0.860124  0.717670  0.890939
8  0.440686  0.144522  0.883361  0.588619  0.860853
9  0.363597  0.477931  0.118070  0.995835  0.646971

In [25]:
type(df3)

pandas.core.frame.DataFrame

In [26]:
df3.describe

<bound method NDFrame.describe of             0         1         2         3         4
0    0.721386  0.407092  0.677209  0.788946  0.434118
1    0.138462  0.076653  0.711549  0.381831  0.486913
2    0.941958  0.566208  0.092995  0.778204  0.508077
3    0.333548  0.282038  0.043280  0.732699  0.298873
4    0.286634  0.729357  0.368197  0.162860  0.570876
..        ...       ...       ...       ...       ...
329  0.112327  0.624903  0.776639  0.692923  0.644337
330  0.959048  0.920300  0.027722  0.301824  0.281665
331  0.483734  0.550500  0.545368  0.475461  0.705706
332  0.656916  0.890126  0.084988  0.517374  0.948894
333  0.750539  0.796166  0.602359  0.520711  0.086074

[334 rows x 5 columns]>

In [27]:
df3.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [28]:
df3.index

Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
       ...
       324, 325, 326, 327, 328, 329, 330, 331, 332, 333],
      dtype='int32', length=334)

In [29]:
df3.columns

RangeIndex(start=0, stop=5, step=1)

In [30]:
df3.to_numpy

<bound method DataFrame.to_numpy of             0         1         2         3         4
0    0.721386  0.407092  0.677209  0.788946  0.434118
1    0.138462  0.076653  0.711549  0.381831  0.486913
2    0.941958  0.566208  0.092995  0.778204  0.508077
3    0.333548  0.282038  0.043280  0.732699  0.298873
4    0.286634  0.729357  0.368197  0.162860  0.570876
..        ...       ...       ...       ...       ...
329  0.112327  0.624903  0.776639  0.692923  0.644337
330  0.959048  0.920300  0.027722  0.301824  0.281665
331  0.483734  0.550500  0.545368  0.475461  0.705706
332  0.656916  0.890126  0.084988  0.517374  0.948894
333  0.750539  0.796166  0.602359  0.520711  0.086074

[334 rows x 5 columns]>

In [31]:
df3.T

,0,1,2,3,4,5,6,7,8,9,...,324,325,326,327,328,329,330,331,332,333
0,0.721386,0.138462,0.941958,0.333548,0.286634,0.306051,0.615842,0.832138,0.440686,0.363597,...,0.441220,0.546405,0.649541,0.007289,0.892775,0.112327,0.959048,0.483734,0.656916,0.750539
1,0.407092,0.076653,0.566208,0.282038,0.729357,0.858420,0.518984,0.284155,0.144522,0.477931,...,0.724542,0.887606,0.884924,0.833763,0.174634,0.624903,0.920300,0.550500,0.890126,0.796166
2,0.677209,0.711549,0.092995,0.043280,0.368197,0.008512,0.644410,0.860124,0.883361,0.118070,...,0.261583,0.519764,0.386055,0.008678,0.561840,0.776639,0.027722,0.545368,0.084988,0.602359
3,0.788946,0.381831,0.778204,0.732699,0.162860,0.787170,0.164802,0.717670,0.588619,0.995835,...,0.009375,0.853757,0.906270,0.547650,0.272319,0.692923,0.301824,0.475461,0.517374,0.520711
4,0.434118,0.486913,0.508077,0.298873,0.570876,0.002022,0.760038,0.890939,0.860853,0.646971,...,0.413217,0.666141,0.138312,0.544214,0.184518,0.644337,0.281665,0.705706,0.948894,0.086074

In [32]:
df.head

<bound method NDFrame.head of     name  marks     city
0  harry     92   rampur
1  rohan     34  kolkata
2   anuj     24     mhow>

In [33]:
df3.sort_index(axis=1, ascending=False)

            4         3         2         1         0
0    0.434118  0.788946  0.677209  0.407092  0.721386
1    0.486913  0.381831  0.711549  0.076653  0.138462
2    0.508077  0.778204  0.092995  0.566208  0.941958
3    0.298873  0.732699  0.043280  0.282038  0.333548
4    0.570876  0.162860  0.368197  0.729357  0.286634
..        ...       ...       ...       ...       ...
329  0.644337  0.692923  0.776639  0.624903  0.112327
330  0.281665  0.301824  0.027722  0.920300  0.959048
331  0.705706  0.475461  0.545368  0.550500  0.483734
332  0.948894  0.517374  0.084988  0.890126  0.656916
333  0.086074  0.520711  0.602359  0.796166  0.750539

[334 rows x 5 columns]

In [34]:
type(df3[0])

pandas.core.series.Series

In [35]:
df4 = df3.copy()

In [36]:
df3.loc[0,0] = 53343

In [37]:
df3.head

<bound method NDFrame.head of                 0         1         2         3         4
0    53343.000000  0.407092  0.677209  0.788946  0.434118
1        0.138462  0.076653  0.711549  0.381831  0.486913
2        0.941958  0.566208  0.092995  0.778204  0.508077
3        0.333548  0.282038  0.043280  0.732699  0.298873
4        0.286634  0.729357  0.368197  0.162860  0.570876
..            ...       ...       ...       ...       ...
329      0.112327  0.624903  0.776639  0.692923  0.644337
330      0.959048  0.920300  0.027722  0.301824  0.281665
331      0.483734  0.550500  0.545368  0.475461  0.705706
332      0.656916  0.890126  0.084988  0.517374  0.948894
333      0.750539  0.796166  0.602359  0.520711  0.086074

[334 rows x 5 columns]>

In [38]:
df3.drop(0,axis=1)

            1         2         3         4
0    0.407092  0.677209  0.788946  0.434118
1    0.076653  0.711549  0.381831  0.486913
2    0.566208  0.092995  0.778204  0.508077
3    0.282038  0.043280  0.732699  0.298873
4    0.729357  0.368197  0.162860  0.570876
..        ...       ...       ...       ...
329  0.624903  0.776639  0.692923  0.644337
330  0.920300  0.027722  0.301824  0.281665
331  0.550500  0.545368  0.475461  0.705706
332  0.890126  0.084988  0.517374  0.948894
333  0.796166  0.602359  0.520711  0.086074

[334 rows x 4 columns]

In [39]:
df3.loc[[1,2],[3,4]]

          3         4
1  0.381831  0.486913
2  0.778204  0.508077

In [40]:
df3.loc[[1,2],:]

          0         1         2         3         4
1  0.138462  0.076653  0.711549  0.381831  0.486913
2  0.941958  0.566208  0.092995  0.778204  0.508077

In [41]:
df5 = df3.loc[(df3[0]<0.3) & (df3[2]>0.1)]

In [42]:
df5.iloc[0,4]

0.4869134709088664

In [43]:
df5

            0         1         2         3         4
1    0.138462  0.076653  0.711549  0.381831  0.486913
4    0.286634  0.729357  0.368197  0.162860  0.570876
13   0.093858  0.068851  0.129293  0.018867  0.500173
18   0.128228  0.411034  0.503225  0.683565  0.249197
21   0.232671  0.847339  0.269441  0.886115  0.571315
..        ...       ...       ...       ...       ...
313  0.081537  0.974227  0.803922  0.539231  0.168042
316  0.062120  0.457026  0.951510  0.098603  0.869105
318  0.182865  0.007911  0.555827  0.269045  0.280257
319  0.080321  0.174742  0.654607  0.743339  0.924659
329  0.112327  0.624903  0.776639  0.692923  0.644337

[83 rows x 5 columns]

In [44]:
df3.drop([1,3],axis=1,inplace=True)

In [45]:
df3

                0         2         4
0    53343.000000  0.677209  0.434118
1        0.138462  0.711549  0.486913
2        0.941958  0.092995  0.508077
3        0.333548  0.043280  0.298873
4        0.286634  0.368197  0.570876
..            ...       ...       ...
329      0.112327  0.776639  0.644337
330      0.959048  0.027722  0.281665
331      0.483734  0.545368  0.705706
332      0.656916  0.084988  0.948894
333      0.750539  0.602359  0.086074

[334 rows x 3 columns]

In [46]:
df3.reset_index(drop=True,inplace = True)

In [47]:
df3.head(10)

              0         2         4
0  53343.000000  0.677209  0.434118
1      0.138462  0.711549  0.486913
2      0.941958  0.092995  0.508077
3      0.333548  0.043280  0.298873
4      0.286634  0.368197  0.570876
5      0.306051  0.008512  0.002022
6      0.615842  0.644410  0.760038
7      0.832138  0.860124  0.890939
8      0.440686  0.883361  0.860853
9      0.363597  0.118070  0.646971

In [48]:
df3[0].isnull()

0      False
1      False
2      False
3      False
4      False
       ...
329    False
330    False
331    False
332    False
333    False
Name: 0, Length: 334, dtype: bool

In [49]:
df3.loc[:,[0]] = None

C:\Users\yadav\AppData\Local\Temp\ipykernel_4352\409708124.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise in a future error of pandas. Value 'None' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  df3.loc[:,[0]] = None

In [50]:
df3[0].isnull()

0      True
1      True
2      True
3      True
4      True
       ...
329    True
330    True
331    True
332    True
333    True
Name: 0, Length: 334, dtype: bool

In [51]:
df.isnull()

    name  marks   city
0  False  False  False
1  False  False  False
2  False  False  False

In [52]:
df.notnull()

   name  marks  city
0  True   True  True
1  True   True  True
2  True   True  True

In [54]:
data = pd.read_excel('Test.xlsx')

In [55]:
data

,Maturity Date,Maturity Amount,Bank,eTDR (last 4 digits),Principal,ROI,Yrs,Nominee (Vicky / Anjali),Scheme,15G FY 24-25,Linked (Y/N),Matured (Y/N)
0,2023-03-10,52783,Kotak,6451,50000,0.0410,1.0,Anjali,Redeem,Y,Y,Y
1,2024-05-30,52783,SBI,2117,50000,0.0330,3.3,Anjali,Redeem,Y,N,Y
2,2023-03-30,30116,Kotak,8868,25000,0.0760,1.2,Anjali,Renew,N,N,Y
3,2023-04-09,52783,SBI,3637,50000,0.0510,2.3,Vicky,Redeem,N,N,Y
4,2023-04-21,30116,HSBC,4484,25000,0.0625,1.4,Anjali,Renew,N,Y,Y
...,...,...,...,...,...,...,...,...,...,...,...,...
95,2026-04-17,52834,Kotak,9475,50000,0.0625,1.0,Vicky,Redeem,N,N,N
96,2026-04-29,30116,SBI,1727,25000,0.0625,1.1,Anjali,Redeem,N,Y,N
97,2026-05-11,52874,HSBC,4016,50000,0.0510,3.2,Vicky,Renew,Y,N,N
98,2026-05-23,30116,Kotak,3291,25000,0.0470,1.3,Vicky,Redeem,Y,N,N
99,2026-06-04,26432,SBI,7418,25000,0.0625,1.0,Anjali,Renew,N,N,N